In [25]:
import pandas as pd

In [26]:
data = pd.read_csv("./evolver_2016_scores.csv")

In [27]:
data.head()

   3874
0  3838
1  3719
2  3678
3  3624
4  3593

In [28]:
data.shape

(41147, 1)

In [29]:
data.isnull().sum()

3874    0
dtype: int64

In [30]:
data.describe()

               3874
count  41147.000000
mean       2.431891
std       74.045976
min        0.000000
25%        0.000000
50%        0.000000
75%        0.000000
max     3838.000000

In [38]:
data['3874'].unique()

array([3838, 3719, 3678, 3624, 3593, 3519, 3497, 3155, 3024, 2895, 2835,
       2768, 2748, 2649, 2430, 2220, 2104, 2075, 2054, 2046, 2018, 1944,
       1933, 1905, 1822, 1821, 1813, 1590, 1524, 1374, 1309, 1195, 1170,
       1099, 1007,  950,  884,  802,  776,  746,  660,  608,  573,  533,
        492,  477,  418,  413,  407,  386,  376,  369,  338,  304,  303,
        302,  278,  270,  266,  257,  255,  239,  237,  234,  228,  208,
        187,  183,  171,  156,  137,  135,  128,  118,  108,  100,   90,
         88,   62,   57,   55,   50,   49,   47,   46,   44,   43,   42,
         37,    0,   35,   34,   33,   32,   30], dtype=int64)

In [39]:
data['3874'].value_counts()

0       41043
950         2
46          2
266         2
369         2
        ...
1374        1
1524        1
1590        1
1813        1
30          1
Name: 3874, Length: 95, dtype: int64

In [40]:
data['3874'] == 0

0        False
1        False
2        False
3        False
4        False
         ...
41142     True
41143     True
41144     True
41145     True
41146     True
Name: 3874, Length: 41147, dtype: bool

In [45]:
data[data['3874'] <= 100]

       3874
79      100
80      100
81       90
82       90
83       88
...     ...
41142     0
41143     0
41144     0
41145     0
41146     0

[41068 rows x 1 columns]